menu = ['Главное меню',
        'Создать файл',
        'Открыть файл',
        'Сохранить файл',
        'Показать контакты',
        'Создать контакт',
        'Найти контакты',
        'Изменить контакт',
        'Удалить контакт',
        'Выход']

input_menu = 'Выберите пункт меню: '
input_menu_error = f'Ввести нужно ЧИСЛО (от 1 до {len(menu) - 1})'

empty_book_error = 'Телефонная книга пуста или не открыта'

input_contact = ['Введите имя нового контакта: ', 
                 'Номер: ', 
                 'Комментарий: ']

input_edit_contact = ['Введите новое имя контакта или ENTER, чтобы оставить без изменений',
                      'Новый номер телефона или ENTER, чтобы оставить без изменений', 
                      'Новый комментарий или ENTER, чтобы оставить без изменений']

input_search_word = 'Введите ключевое слово для поиска: '

input_edit_contact_id = 'Введите ID контакта, который хотите изменить: '
input_del_contact_id = 'Введите ID контакта, который хотите удалить: '

operation = ['создан', 'изменен', 'удален']
action_file = ['создана', 'загружена', 'сохранена']

confirm_changes = 'У вас есть несохраненные изменения! Сохранить? (y/n) '
exit_program = 'До свидания! До новых встреч!'
def not_find(word):
    return f'Контакт, содержащий {word}, не найден'

def contact_action(name: str, action: str) -> str:
    return f'Контакт {name} успешно {action}!'


def file_succesful(action_file: str) -> str:
    return f'Телефонная книга успешно {action_file}'

